{"title":"经验/写作/资料收集/知识星球/『谈谈写作与写作的意义』","date":"2024-01-19T05:44:05.726Z","date_formatted":{"ll":"Jan 19, 2024","L":"01/19/2024","MM-DD":"01-19"},"link":"2024/01/19/经验/写作/资料收集/知识星球/『谈谈写作与写作的意义』","updated":"2024-01-19T08:23:11.816Z","content":"<p>谈谈写作与写作的意义</p>\n<p>码了大约 3600 字，断断续续用了 2 天的时间才总结完，希望对各位技术圈友有所帮助。</p>\n<p>开放的心态，理性的认知，无边的海洋。</p>\n<p>今天主要和大家分享以下内容：</p>\n<ol>\n<li>我的写作格式观 ？</li>\n<li>写作的意义 ？</li>\n<li>如何写作 ？</li>\n<li>写作的渠道 ？</li>\n<li>其它 ？</li>\n</ol>\n<p>① 我的写作格式观</p>\n<p>研究显示，打字的时候不喜欢在中文和英文之间加空格的人，感情路都走得很辛苦，有七成的比例会在 34 岁的时候跟自己不爱的人结婚，而其余三成的人最后只能把遗产留给自己的猫，当然这只是研究，大家不必太当真。</p>\n<p>我加入了不少知识付费圈子、付费社群，订阅了很多公众号，其实大家只要细心观察过星球分享的主题、以及日常聊天的记录，公众号写的文章，基本很少有人注重 <code>写作格式</code>。</p>\n<p>今天和大家谈谈我的写作格式观，希望对正在写作、或者即将写作的圈友有帮助。</p>\n<ol>\n<li>\n<p>中英文之间加空格 （产品、官方名除外）<br>\n√ 学习 Vue 知识<br>\n× 学习Vue知识</p>\n</li>\n<li>\n<p>中文与数字之间加空格<br>\n√ 胡润发布中国财富自由门槛，一线城市入门级为 1900 万元。<br>\n× 胡润发布中国财富自由门槛，一线城市入门级为1900万元。</p>\n</li>\n<li>\n<p>不重复使用标点符号<br>\n√ 真让人震撼！<br>\n× 真让人震撼！！！</p>\n</li>\n<li>\n<p>专有名词正确使用大小写<br>\n√ Android、Google<br>\n× android、google、GOOGLE</p>\n</li>\n<li>\n<p>不建议全文一段而成，也不建议一段 500 字以上。</p>\n</li>\n</ol>\n<p>以上几点是我平常在聊天、写作时保持的习惯，关于更多的写作排版指南，我为你准备了中文写作排版指北链接（链接请在文末查看）。一个好的写作风格，不仅可以让自己舒服，也能让读者在阅读中享受，在阅读中思考。</p>\n<p>② 写作的意义</p>\n<p>我一直认可一句话，那就是大家常说的输出倒逼输入，人与人的最大的差距，我一直认为是信息输入量的差距，当然这里说的信息是指有价值的信息。赚钱的本质是信息差，商业的本质是赚差价，我觉得这句话可以论证信息输入量的差距这个观点。</p>\n<p>写作本身是通过知识输出的方式去学习，包括我写这篇主题分享，实质上也是一种学习，它是更高级的终身学习方式。知识的输出方式有很多，不仅有写作，还有授课、聊天等。</p>\n<p>这里我概括总结了 3 点写作的意义：</p>\n<ol>\n<li>写作是一种高质量的社交</li>\n</ol>\n<p>有句话说的特别好，低质量的社交，不如高质量的独处。写作其实就是一种高质量的社交，如果你喜欢分享，一定有这个体会。通过写作我们可以分享自己的观点、知识，通过文章去链接更优秀的读者，认识更优秀的人，这是一种正向循环，如果你写的文章质量很高，那么通过写作很容易产生影响力。</p>\n<ol start=\"2\">\n<li>写作能创造无限的机会</li>\n</ol>\n<p>我写的文章、主题可能没有向某些大 V 那么多，但是仅仅是几篇文章分享给我创造了无限的机会。我一直认为越分享、越幸运，事实也验证了这个观点，我就是那个幸运的人。</p>\n<p>大学之前，包括电脑的开机操作我都不熟练，更别说打字写作了。后来我开始尝试写作，虽然我没有输出多少。但是让我认识了很多人，包括与我合伙的朋友都是通过写作认识的，后来在知识星球中输出，认识了更多优秀的人，了解到一些大佬的机会都和写作息息相关，这些机会是无法用金钱来衡量的。</p>\n<ol start=\"3\">\n<li>写作是一种更高级的终身学习模式</li>\n</ol>\n<p>输出倒逼输入这个观点，很多大佬再谈，如果你要写好一篇文章、做好一篇主题分享，你需要不断的输入，输入高质量的信息就是一种更高级的学习模式。当你在摄入信息时，当你在阅读时，你是在被动的学习，被动的接受别人的观点，跟着大家点赞，你可能从未全面调动你的大脑去思考，去分析作者的观点。写作却截然不同，你需要去查找资料，去积累素材，去总结经验，去分析问题，去思考等，然后才能写出一篇有价值的文章。当你的文章写完之后，你会发布到各个平台，发布之后，就代表有更多的人要与你互动，在互动的过程中你又进行的二次学习，二次社交。所以说写作时一种更高级的学习模式，如果写作能成为你的爱好，那么写作一定是终身受益的。</p>\n<p>③ 如何写作</p>\n<p>关于如何写作，网上很多大佬都在分享，也有不少训练营、视频课程。是不是说再收割韭菜，这个就看大家觉得是否值得，人这一生谁又不是韭菜呢？</p>\n<p>很多人不愿意分享，觉得写作太难，其实不知识你有这个问题，很多人都有这个问题。万事开头难，写作也一样，最难的是开始动笔，写作本来就是一件烧脑的事。我有时写一篇主题分享需要几天才能写完，很多人可能觉得不可思议，写过文章，做过主题的分享的球友应该知道写作所需要花费的时间。</p>\n<p>写作最难的就是开始动笔，当你真正开始写作的时候，你会发现写作并没有那么难，只要你能坚持下去，你其实已经成功了一半。</p>\n<p>如果你还在犹豫是否需要写作，是否需要分享的时候，可以认真阅读以上我分享写作的意义。</p>\n<p>接下来和大家分享一些我一路以来的写作心得，希望对大家的写作有帮助。</p>\n<p>我是一个对信息特别敏感的人，日常学习中我就会收集一些写作相关的主题与素材，我有一个收藏夹，我也对收藏夹进行了分类，主要有书籍金句摘录，名人名言，写作工具，优质文章，主题分享。<br>\n这个收藏夹的作用就是记录学习、阅读的一些关键信息，毕竟人的记忆是有限的。<br>\n在写作的时候，我不会立马开始动手，而是先构思主题，构思主题可能需要 1 小时、1 天、甚至好几天。</p>\n<p>想好主题写什么以后，我会搜索相关的主题，这里用到的知识就是 SEO，利用搜索的好处就是，可以看看该主题有没有相关的人再写，也可以了解话题的热门程度，同时也可以借鉴参考，这些过程基本都是浏览，不会太耗费时间。</p>\n<p>上面的流程走完之后，我会罗列一个写作大纲，大纲可以基本确定写作的方向与内容，可以帮助我快速梳理写作思路，然后进入写作状态。</p>\n<p>写作的过程中，我喜欢在安静的地方进行，不喜欢太吵杂的地方，这样可以让我完全投身于写作中去，好处就是不容易打断我的写作思路。</p>\n<p>关于写作的具体方法，网上一大堆，我这里想给大家的建议就是，多输入信息，多阅读，多浏览，多思考，多动手。</p>\n<p>有些人做事，是因为自己喜欢，能够从中找到自己的兴趣，感觉做这件事可以实现自己的价值，让自己的人生更有意义。当你开始写作的时候，你就会发现写作其实是一件特别有意思的事情。</p>\n<p>很多人不知道写什么？这里给大家提供几个寻找写作主题的渠道：</p>\n<ul>\n<li>知乎</li>\n</ul>\n<p>知乎是国内最大的问答社区，很多大佬都在上面写作，寻找主题，在知乎上面一个问题可以看做一个主题，一个问题你可以发表不同的观点，针对知乎这些问题，你去写作，主题和思路是不是突然觉得很多。</p>\n<ul>\n<li>微博、头条</li>\n</ul>\n<p>不管是微博，还是头条，每天都有很多新闻，你只需要关注和你写作相关的领域，然后去观察，去发现，网友的评论都可能成为你写作的主题。</p>\n<ul>\n<li>读书</li>\n</ul>\n<p>书中自有黄金屋，书中自有颜如玉。现在读书的渠道很多，不管是通过纸质书籍，还是通过微信读书、知乎读书等，基本不需要花费太多的金钱，就可以读到很多好书。我每天都会至少花费半小时去读书，因为在读书的过程中，除了提升了我的认知，还能在书中发现有意思的观点，故事，金句，这些都会被我记录到收藏夹中。</p>\n<p>④ 写作的渠道</p>\n<p>在这个信息大爆炸的时代，人人都可以在网上发表自己的观点，写作的平台也很多，不过目前最有价值的写作平台还是公众号，只要你的公众号读者多，变现起来也是相当可观的。</p>\n<p>目前主流的写作平台我罗列一些，还不知道的这些写作平台的圈友可以去搜索了解一下。</p>\n<p>公众号、博客、GitHub、百家号、头条号、知乎、简书、V2EX、企鹅号、网易号、掘金社区、大鱼号、搜狐号、趣头条等。</p>\n<p>上面的这些平台最强的写作变现平台，我认为目前依然是基于微信的生态的公众号平台。</p>\n<p>⑤ 其它</p>\n<p>很多人觉得自己写完文章没人阅读，没人互动，其实刚开始写作这是一件很正常的事，刚开始写作你基本没有任何读者积累，可以先通过朋友关注、转发积累第一批读者。</p>\n<p>刚开始写作的质量肯定也没那么高，遇到喷子，不要气馁，坚持下去，写作有一个过程，没人看不代表你的文章质量不好。<br>\n关于写作推广这件事，给大家的建议就是分享到朋友圈，一些微信群，以及分发到上面说的相关自媒体平台，每个平台的规则不一样，建议大家仔细研究各个平台的规则，决定是否留联系方式。</p>\n<p>现在通过公众号写作涨粉越来越难了，给大家的一个建议就是写一些优质的文章，链接一些优质的人脉，如果你写的文章足够好，公众号大 V 也愿意帮助你转发，能给你带来一些读者。</p>\n<p>本次分享我基本没有和大家谈写作变现的事情，就是想告诉大家一点，学会延迟满足。普通人通过写作短期是很难变现的，刚开始写作就想着接广告赚钱是不切合实际的。写作是一件需要长期坚持去做的事，好饭不怕晚，越分享越幸运。</p>\n<p>最后，感谢大家的阅读，觉得有价值，记得点个赞，支持一下。</p>\n<p>GitHub - mzlogin/chinese-copywriting-guidelines: C… （中文写作排版之北，搜索来自于 GitHub）</p>\n<p><a href=\"https://mazhuang.org/wiki/chinese-copywriting-guidelines/\" target=\"_blank\">https://mazhuang.org/wiki/chinese-copywriting-guidelines/</a></p>\n","prev":{"title":"经验/写作/资料收集/知识星球/〖程序员面试技巧〗","link":"2024/01/19/经验/写作/资料收集/知识星球/〖程序员面试技巧〗"},"next":{"title":"『Ant Design』使用","link":"2024/01/19/Project/从零玩转 TS + React 项目实战/Ant Design/01-『Ant Design』使用"},"plink":"http://example.com/2024/01/19/经验/写作/资料收集/知识星球/『谈谈写作与写作的意义』/"}